data_generation/simulation_results/openfoam/case_7/constant/simParams
nIter 2000;
hComponent0 804.9014986002129;
hComponent1 1251.9803442571824;
hComponent2 1052.5646394327357;
hComponent3 1276.4236299518136;
hComponent4 1259.6914872263364;kComponent0 68.28507191179284;
kComponent1 27.050772047887833;
kComponent2 80.20127764166136;
kComponent3 17.410211663748242;
kComponent4 11.120847598845595;
tAmbient 300;
Ux 2.341904617791159;
kPCB 0.8245129961875426;